app/controllers/application_controller.rb

  def index
    @reservation = Reservation.all
---
SELECT "reservations".* FROM "reservations"