app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "guests", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Blah"], ["guests", 1], ["created_at", "2017-09-03 20:14:11.888583"], ["updated_at", "2017-09-03 20:14:11.888583"]]
---
  def create
    @customer = Customer.new(customer_params)

    if @customer.save