app/controllers/reservations_controller.rb

SELECT "tables".* FROM "tables"
INSERT INTO "reservations" ("name", "guests", "table_id", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "badsofhads"], ["guests", 1], ["table_id", 1], ["time", "2017-09-03 22:45:00.000000"], ["created_at", "2017-09-03 22:45:54.521967"], ["updated_at", "2017-09-03 22:45:54.521967"]]
---
  def create
    @reservation = Reservation.new(reservation_params)

    Reservation.find_table

    if @reservation.save